package org.example._2023_06_15;

public class Task2212 {}
/**
 * /**
 *      * Класс Person  name (имя) и age (возраст)
 *      *
 *      * 1. Создать и заполнить две мапы.
 *      * Затем перебрать обе мапы и вывести на экран
 *      * информацию о каждом человеке (из Map<String, Person>)
 *      * в формате: "Имя: <name>, Возраст: <age>".
 *
 *      * Для каждого элемента Map<String, String> добавить
 *      * к значению строку "is a person".
 *
 *      * 2. Создать и заполнить две мапы.
 *      * Затем перебрать обе мапы и вывести на экран
 *      * только имена людей (из Map<String, Person>).
 *
 *      * 3. Создать и заполнить две мапы.
 *      * Затем перебрать обе мапы и вывести на экран
 *      * средний возраст всех людей (из Map<String, Person>).
 *
 *      * 4. Создать и заполнить две мапы.
 *      * Затем перебрать обе мапы и создать новый мап
 *      * (Map<String, String>), где ключом будет имя человека,
 *      * а значением будет его возраст в виде строки.
 *
 *
 *
 *          * 1. Найти сумму всех элементов в каждой
 *          * строке двумерного массива и вывести на экран.
 *          *
 *          * 2. Найти наибольший элемент в
 *          * каждом столбце двумерного массива и вывести на экран.
 *          *
 *          * 3. Отсортировать каждую строку двумерного массива
 *          * в порядке возрастания и вывести отсортированный массив на экран.
 *          *
 *          * 4. Посчитать количество вхождений определенного
 *          * числа в каждом столбце двумерного массива и вывести на экран.
 *          *
 *          * СНАЧАЛА СОЗДАТЬ МЕТОД КОТОРЫЙ ВОЗВРАЩАЕТ СГЕНЕРИРОВАННЫЙ
 *          * ДВУМЕРНЫЙ МАССИВ РАНДОМНОЙ ДЛИНЫ И ВЫСОТЫ И С РАНДОМНЫМИ ЧИСЛАМИ
 *          * ДАЛЕЕ ПЕРЕДАВАТЬ РЕЗУЛЬТАТ РАБОТЫ ЭТОГО МЕТОДА В КАЧЕСТВЕ ПАРАМЕТРА
 *
 *      */
